export default {
  // 系统提示
  '0': '操作成功',
  '100': '系统故障!',
  '101': '数据库操作出错!',
  '102': '用户认证失败!',
  '103': '未经授权!',
  '104': '授权过期!',
  '105': '服务不可用!',
  '106': '请求参数无效!',
  '107': '缺少请求参数!',
  '108': '没有权限访问!',

  // UPMS模块
  '200': '用户不存在!',
  '201': '账号密码错误!',
  '203': '账号已被锁定!',
  '310': '性别未在区间内!',
  '311': '手机号格式错误!',
  '312': '邮箱格式错误!',
  '313': '出生日期错误!',
  '314': '原始密码错误!',
  '320': '该角色Name或Code已存在!',
  '321': '不能删除自己的角色!',
  '330': '该角色不存在!',
  '331': '该账号已存在!',
  '332': '状态范围错误!',

  // Sys模块
  '401': '字典类型已经存在!',
  '402': '字典名称已经存在!',

  // Http
  '503': '服务不可用'
}
